<h1> TP2: Nettoyage des donn√©es </h1>

In [5]:
import pandas as pd

In [6]:
df=pd.read_csv("property_data - property_data.csv")

In [7]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [8]:
df.dtypes

PID             float64
ST_NUM          float64
ST_NAME          object
OWN_OCCUPIED     object
NUM_BEDROOMS     object
NUM_BATH         object
SQ_FT            object
dtype: object

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  7 non-null      object
 5   NUM_BATH      8 non-null      object
 6   SQ_FT         8 non-null      object
dtypes: float64(2), object(5)
memory usage: 636.0+ bytes

In [10]:
df.head(2)

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --

In [15]:
df.tail()

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [31]:
print("la dimension de notre dataframe est", df.shape) #dimension de la df

la dimension de notre dataframe est (9, 7)

In [30]:
print("le nombre des lignes du dataframe est √©gale √† : ",df.shape[0])
print("le nombre des colonnes du dataframe est √©gale √† : ",df.shape[1])

le nombre des lignes du dataframe est √©gale √† :  9
le nombre des colonnes du dataframe est √©gale √† :  7

In [26]:
df.columns

Index(['PID', 'ST_NUM', 'ST_NAME', 'OWN_OCCUPIED', 'NUM_BEDROOMS', 'NUM_BATH',
       'SQ_FT'],
      dtype='object')

In [27]:
df.columns.values

array(['PID', 'ST_NUM', 'ST_NAME', 'OWN_OCCUPIED', 'NUM_BEDROOMS',
       'NUM_BATH', 'SQ_FT'], dtype=object)

In [23]:
df.values

array([[100001000.0, 104.0, 'PUTNAM', 'Y', '3', '1', '1000'],
       [100002000.0, 197.0, 'LEXINGTON', 'N', '3', '1.5', '--'],
       [100003000.0, nan, 'LEXINGTON', 'N', nan, '1', '850'],
       [100004000.0, 201.0, 'BERKELEY', '12', '1', nan, '700'],
       [nan, 203.0, 'BERKELEY', 'Y', '3', '2', '1600'],
       [100006000.0, 207.0, 'BERKELEY', 'Y', nan, '1', '800'],
       [100007000.0, nan, 'WASHINGTON', nan, '2', 'HURLEY', '950'],
       [100008000.0, 213.0, 'TREMONT', 'Y', '1', '1', nan],
       [100009000.0, 215.0, 'TREMONT', 'Y', 'na', '2', '1800']],
      dtype=object)

In [24]:
df.describe()

                PID      ST_NUM
count  8.000000e+00    7.000000
mean   1.000050e+08  191.428571
std    2.927700e+03   39.080503
min    1.000010e+08  104.000000
25%    1.000028e+08  199.000000
50%    1.000050e+08  203.000000
75%    1.000072e+08  210.000000
max    1.000090e+08  215.000000

In [32]:
df.describe(include="all")

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
count,8.000000e+00,7.000000,9,8,7,8,8
unique,NaN,NaN,5,3,4,4,8
top,NaN,NaN,BERKELEY,Y,3,1,1000
freq,NaN,NaN,3,5,3,4,1
mean,1.000050e+08,191.428571,NaN,NaN,NaN,NaN,NaN
std,2.927700e+03,39.080503,NaN,NaN,NaN,NaN,NaN
min,1.000010e+08,104.000000,NaN,NaN,NaN,NaN,NaN
25%,1.000028e+08,199.000000,NaN,NaN,NaN,NaN,NaN
50%,1.000050e+08,203.000000,NaN,NaN,NaN,NaN,NaN
75%,1.000072e+08,210.000000,NaN,NaN,NaN,NaN,NaN
max,1.000090e+08,215.000000,NaN,NaN,NaN,NaN,NaN